src/InformationRegisters/ЗаказыПокупателейССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыПокупателейССайта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменУправлениеНебольшойФирмойСайт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыИдентификацииКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СпособыИдентификацииКонтрагентов</Name>
			<Comment>Способы идентификации контрагентов для обмена заказами с сайтом</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоздаватьИскатьПоТелефонуEmail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздаватьИскатьПоТелефонуEmailНаименованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИННКПП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредопределенноеЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПротоколыОбменаCMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПротоколыОбменаCMS</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>UMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Битрикс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСтруктурнойЕдиницы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтруктурныхЕдиниц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрдерныйСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМОЛ</Name>
					<Comment>Подпись материально-ответственного лица</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозничныйВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаВРознице</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНаценки</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОтходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяОтходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяСписанияНаРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяПередачиВЭксплуатацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаИсточникаВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучателяВозвратаИзЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбменССайтомВебСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьЗаказы(ДатаИзменения, КодУзлаОбмена = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КодУзлаОбмена) Тогда
	
		УзелОбмена = ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.НайтиПоКоду(КодУзлаОбмена);
		Если ЗначениеЗаполнено(УзелОбмена) Тогда
		
			Возврат ОбменССайтом.ПолучитьЗаказыВебСервис(ДатаИзменения, УзелОбмена, НСтр("ru = 'Обмен веб-сервис в формате 2.10'"));
			
		КонецЕсли;
	КонецЕсли; 
	
	Параметры = ПолучитьСтруктуруПараметровОбмена();
	
	Параметры.Вставить("ВыполнятьОбменТовары", Истина);
	Параметры.Вставить("ВыполнятьОбменЦены", Ложь);
	Параметры.Вставить("ВыполнятьОбменЗаказы", Ложь);
	Параметры.Вставить("СоответствиеПолейНоменклатуры", Новый Соответствие);

	СтруктураСтатистики = Новый Структура;	
	СтруктураСтатистики.Вставить("ОбработаноНаЗагрузке", 0);
	СтруктураСтатистики.Вставить("Загружено" , Новый Массив);
	СтруктураСтатистики.Вставить("Пропущено" , Новый Массив);
	СтруктураСтатистики.Вставить("Обновлено" , Новый Массив);
	СтруктураСтатистики.Вставить("Создано"   , Новый Массив);
	СтруктураСтатистики.Вставить("Выгружено" , Новый Массив);
	
	МассивИзменений = ПолучитьЗаказыДляВыгрузки(ДатаИзменения);
	Если ЗначениеЗаполнено(ДатаИзменения) И МассивИзменений.Количество() = 0 Тогда
		Возврат Параметры.ПустойПакетXDTO;
	Иначе
		ЗаказыXDTO = ОбменССайтом.СформироватьЗаказыXDTO_ВерсияCommerceML205a(МассивИзменений, СтруктураСтатистики, Параметры);
	КонецЕсли;
	
	Если ЗаказыXDTO = Неопределено Тогда
		Возврат Параметры.ПустойПакетXDTO;
	КонецЕсли;
	
	Возврат ЗаказыXDTO;
	
КонецФункции // ПолучитьЗаказы()

Функция ЗагрузитьЗаказы(ДанныеЗаказовXDTO, КодУзлаОбмена = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КодУзлаОбмена) Тогда
	
		УзелОбмена = ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.НайтиПоКоду(КодУзлаОбмена);
		Если ЗначениеЗаполнено(УзелОбмена) Тогда
		
			Возврат ОбменССайтом.ЗагрузитьЗаказыВебСервис(УзелОбмена, ДанныеЗаказовXDTO, НСтр("ru = 'Обмен веб-сервис в формате 2.10'"));
			
		КонецЕсли;
	КонецЕсли; 
	
	Параметры = ПолучитьСтруктуруПараметровОбмена();
	
	Параметры.Вставить("СпособИдентификацииКонтрагентов", Перечисления.СпособыИдентификацииКонтрагентов.СоздаватьИскатьПоТелефонуEmail);
	Параметры.Вставить("НастройкиПоискаКонтрагентов", ОбменССайтом.ЗаписьJSONВСтруктуру(ОбменССайтом.ПоляПоискаКонтрагентовПоУмолчанию(Истина)));
	Параметры.Вставить("ГруппаДляНовыхКонтрагентов", Справочники.Контрагенты.ПустаяСсылка());
	Параметры.Вставить("ГруппаДоступаДляНовыхКонтрагентов", Справочники.ГруппыДоступаКонтрагентов.ПустаяСсылка());
	Параметры.Вставить("ГруппаДляНовойНоменклатуры", Справочники.Номенклатура.ПустаяСсылка());
	Параметры.Вставить("ОбменТоварами", Ложь);
	Параметры.Вставить("ВыгружатьТолькоИзменения", Ложь);
	Параметры.Вставить("ТаблицаСоответствияСтатусовЗаказов", Новый  ТаблицаЗначений);
	Параметры.Вставить("ТаблицаСоответствияСлужбДоставки", Новый  ТаблицаЗначений);
	Параметры.Вставить("ОрганизацияДляПодстановкиВЗаказы", Справочники.Организации.ПустаяСсылка());
	Параметры.Вставить("СкладДляПодстановкиВЗаказы", Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	Параметры.Вставить("СпособУстановкиДатыОтгрузкиЗаказа", Неопределено);
	Параметры.Вставить("СпособУстановкиДатыОтгрузкиЗаказаКоличествоДней", 1);
	Параметры.Вставить("ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузке", Ложь);
	Параметры.Вставить("СоответствиеПолейНоменклатуры", Новый Соответствие);
	Параметры.Вставить("УзелОбмена", ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.ПустаяСсылка());
	
	СтруктураСтатистики = Новый Структура;
	
	СтруктураСтатистики.Вставить("ОбработаноНаЗагрузке", 0);
	СтруктураСтатистики.Вставить("Загружено" , Новый Массив);
	СтруктураСтатистики.Вставить("Пропущено" , Новый Массив);
	СтруктураСтатистики.Вставить("Обновлено" , Новый Массив);
	СтруктураСтатистики.Вставить("Создано"   , Новый Массив);
	
	ЕстьОшибки = Ложь;
	ОписаниеОшибки = "";
	
	Если Не ОбменССайтом.ЗагрузитьЗаказы(ДанныеЗаказовXDTO, СтруктураСтатистики, Параметры, ОписаниеОшибки) Тогда 
		
		ОбменССайтом.ДобавитьОписаниеОшибки(ОписаниеОшибки, НСтр("ru = 'Не удалось обработать документы, загруженные с сервера.'"));
		ЕстьОшибки = Истина;
		
	КонецЕсли;
	
	ЗаписатьРезультатВыполненияОперацииВЖурналРегистрации(НСтр("ru = 'ОбменССайтом.ЗагрузкаЗаказов'"), ОписаниеОшибки, ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции // ЗагрузитьЗаказы()

Функция ПолучитьКлассификаторИКаталог(ДатаИзменения, КодГруппы, КодУзлаОбмена = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КодУзлаОбмена) Тогда
	
		УзелОбмена = ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.НайтиПоКоду(КодУзлаОбмена);
		Если ЗначениеЗаполнено(УзелОбмена) Тогда
		
			Возврат ОбменССайтом.ПолучитьКлассификаторИКаталогВебСервис(ДатаИзменения, КодГруппы, УзелОбмена, НСтр("ru = 'Обмен веб-сервис в формате 2.10'"));
			
		КонецЕсли;
	КонецЕсли; 
	
	Параметры = ПолучитьСтруктуруПараметровОбмена();
	
	Если ЗначениеЗаполнено(КодГруппы)
		И Не ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоКоду(КодГруппы)) Тогда
		Возврат Параметры.ПустойПакетXDTO;
	КонецЕсли;
	
	Параметры.Вставить("ДатаИзменения", ДатаИзменения);
	Параметры.Вставить("КодГруппы"	  , КодГруппы);
	
	Параметры.Вставить("ВыполнятьОбменТовары", Истина);
	Параметры.Вставить("ВыполнятьОбменЦены", Ложь);
	Параметры.Вставить("ВыполнятьОбменЗаказы", Ложь);
	
	ПодготовитьДанныеДляВыгрузкиНоменклатуры(Параметры);
	
	Если Параметры.ВыборкаНоменклатуры.Количество() = 0 Тогда
		Возврат Параметры.ПустойПакетXDTO;
	КонецЕсли;
	
	ИДКаталога = Строка(Новый УникальныйИдентификатор);
	
	URI = "urn:1C.ru:commerceml_205";
	ПакетCML = ФабрикаXDTO.Пакеты.Получить(URI);	
	
	КоммерческаяИнформацияТип = ПакетCML.Получить("КоммерческаяИнформация");
	КоммерческаяИнформацияXDTO = ФабрикаXDTO.Создать(КоммерческаяИнформацияТип);
	
	КоммерческаяИнформацияXDTO.ВерсияСхемы = "2.05";
	КоммерческаяИнформацияXDTO.ДатаФормирования = Параметры.ДатаФормирования;
	
	КлассификаторТип = ПакетCML.Получить("Классификатор");
	КлассификаторXDTO = ФабрикаXDTO.Создать(КлассификаторТип);
	
	КлассификаторXDTO.ИД = ИДКаталога;
	КлассификаторXDTO.Наименование = "Классификатор";
	
	КлассификаторXDTO.Владелец = ОбменССайтом.ПолучитьКонтрагентаXDTO(Параметры.ДанныеОрганизацииВладельцаКаталога, ПакетCML);
	
	ОбменССайтом.ДобавитьГруппыКлассификатораXDTO(КлассификаторXDTO, Параметры.ДеревоГрупп.Строки, Неопределено, ПакетCML, Параметры);
	ОбменССайтом.ДобавитьСвойстваНоменклатурыВКлассификаторXDTO(КлассификаторXDTO, ПакетCML, Параметры.ВыборкаСвойствНоменклатурыДляКлассификатора, Параметры);
	
	Попытка
		КлассификаторXDTO.Проверить();
		КоммерческаяИнформацияXDTO.Классификатор = КлассификаторXDTO;
	Исключение
		Возврат Параметры.ПустойПакетXDTO;
	КонецПопытки;
	
	КаталогТип = ПакетCML.Получить("Каталог");
	КаталогXDTO = ФабрикаXDTO.Создать(КаталогТип);
	
	КаталогXDTO.СодержитТолькоИзменения = Параметры.ДатаИзменения <> '00010101';
	КаталогXDTO.СодержитТолькоИзменения = Ложь;
	КаталогXDTO.Ид = ИДКаталога;
	КаталогXDTO.ИдКлассификатора = ИДКаталога;
	КаталогXDTO.Наименование = "Каталог";
	
	КаталогXDTO.Владелец = ОбменССайтом.ПолучитьКонтрагентаXDTO(Параметры.ДанныеОрганизацииВладельцаКаталога, ПакетCML);
	
	ОбменССайтом.ДобавитьНоменклатуруВКаталогXDTO(КаталогXDTO, ПакетCML, Параметры);
	
	Попытка
		КаталогXDTO.Проверить();
		КоммерческаяИнформацияXDTO.Каталог = КаталогXDTO;
	Исключение
		Возврат Параметры.ПустойПакетXDTO;
	КонецПопытки;
	
	Возврат КоммерческаяИнформацияXDTO;
	
КонецФункции

Функция ПолучитьОстаткиИЦены(ДатаИзменения, КодГруппы, КодСклада, КодОрганизации, КодУзлаОбмена = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КодУзлаОбмена) Тогда
	
		УзелОбмена = ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.НайтиПоКоду(КодУзлаОбмена);
		Если ЗначениеЗаполнено(УзелОбмена) Тогда
		
			Возврат ОбменССайтом.ПолучитьОстаткиИЦеныВебСервис(ДатаИзменения, КодГруппы, КодСклада, КодОрганизации, УзелОбмена, НСтр("ru = 'Обмен веб-сервис в формате 2.10'"));
			
		КонецЕсли;
	КонецЕсли; 

	Параметры = ПолучитьСтруктуруПараметровОбмена();
	
	Если ЗначениеЗаполнено(КодГруппы)
		И Не ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоКоду(КодГруппы)) Тогда
		Возврат Параметры.ПустойПакетXDTO;
	КонецЕсли;
	
	Параметры.Вставить("ДатаИзменения" , ДатаИзменения);
	Параметры.Вставить("КодГруппы"	   , КодГруппы);
	Параметры.Вставить("КодСклада"	   , КодСклада);
	Параметры.Вставить("КодОрганизации", КодОрганизации);
	Параметры.Вставить("ВыполнятьОбменТовары", Ложь);
	Параметры.Вставить("ВыполнятьОбменЦены", Истина);
	Параметры.Вставить("ВыполнятьОбменЗаказы", Ложь);
	
	ИДКаталога = Строка(Новый УникальныйИдентификатор);
	
	URI = "urn:1C.ru:commerceml_205";
	ПакетCML = ФабрикаXDTO.Пакеты.Получить(URI);
	
	КоммерческаяИнформацияТип = ПакетCML.Получить("КоммерческаяИнформация");
	КоммерческаяИнформацияXDTO = ФабрикаXDTO.Создать(КоммерческаяИнформацияТип);
	
	КоммерческаяИнформацияXDTO.ВерсияСхемы = "2.05";
	КоммерческаяИнформацияXDTO.ДатаФормирования = Параметры.ДатаФормирования;
	
	ПодготовитьДанныеДляВыгрузкиОстатковИЦен(Параметры);
	
	Если Параметры.ВыборкаЦен.Количество() = 0 Тогда
		Возврат Параметры.ПустойПакетXDTO;
	КонецЕсли;
	
	ПакетПредложенийXDTO = ФабрикаXDTO.Создать(ПакетCML.Получить("ПакетПредложений"));
	
	ПакетПредложенийXDTO.СодержитТолькоИзменения = Ложь;
	ПакетПредложенийXDTO.Ид = ИДКаталога;
	ПакетПредложенийXDTO.Наименование = "Пакет предложений";
	ПакетПредложенийXDTO.ИдКаталога = ИДКаталога;
	ПакетПредложенийXDTO.ИдКлассификатора = ИДКаталога;
	
	ОбменССайтом.ДобавитьВидыЦенВПакетПредложенийXDTO(ПакетПредложенийXDTO, ПакетCML, Параметры);
	
	ОбменССайтом.ДобавитьПредложенияВПакетПредложенийXDTO(ПакетПредложенийXDTO, ПакетCML, Параметры);
	
	Попытка
		ПакетПредложенийXDTO.Проверить();
		КоммерческаяИнформацияXDTO.ПакетПредложений = ПакетПредложенийXDTO;
	Исключение
		Возврат Параметры.ПустойПакетXDTO;
	КонецПопытки;
	
	Возврат КоммерческаяИнформацияXDTO;
	
КонецФункции

Функция ПолучитьКартинку(ИдентификаторТовараСтрока) Экспорт
	
	Параметры = ПолучитьСтруктуруПараметровОбмена();
	
	МенеджерОбъекта = Справочники.Номенклатура;
	СсылкаНаОбъект = ПолучитьСсылкуПоИдентификатору(МенеджерОбъекта, ИдентификаторТовараСтрока);
	
	МассивСсылокНаТовары = Новый Массив;
	МассивСсылокНаТовары.Добавить(СсылкаНаОбъект);
	
	Выборка = ПолучитьПрисоединенныеФайлы(МассивСсылокНаТовары, Параметры.РазрешенныеТипыКартинок);
	Если Выборка.Следующий() Тогда
		
		СериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
		ДвоичныеДанныеФайла = ПолучитьДвоичныеДанныеФайла(Выборка);
		
		Попытка
			КартинкаXDTO = СериализаторXDTO.ЗаписатьXDTO(ДвоичныеДанныеФайла);
		Исключение
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат КартинкаXDTO;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруПараметровОбмена()

	ОсновныеПараметры = ОбменССайтом.ПолучитьСтруктуруОсновныхПараметровОбмена();
	
	ОсновныеПараметры.Вставить("ОбменЧерезВебСервис", Истина);
	ОсновныеПараметры.Вставить("МассивВидовЦен", Новый Массив);
	ОсновныеПараметры.Вставить("ВыгружатьОстаткиПоСкладам", Ложь);
	ОсновныеПараметры.Вставить("ПротоколОбменаCMS", Перечисления.ПротоколыОбменаCMS.Другая);
	ОсновныеПараметры.Вставить("ПодчиненныеДокументы", Ложь);
	ОсновныеПараметры.Вставить("ОнлайнОплаты", Ложь);
	ОсновныеПараметры.Вставить("РучнаяНастройкаКаталога", Ложь);
	ОсновныеПараметры.Вставить("РазмерПорции", 0);

	// Для совместимости с функциями общего модуля ОбменССайтом
	ОсновныеПараметры.Вставить("ВыгружатьКартинки", Ложь);
	
	СтруктураТаблицыКаталогов = Новый Структура;
	
	СписокГрупп = Новый СписокЗначений;
	СтруктураТаблицыКаталогов.Вставить("СписокГрупп", СписокГрупп);
	
	СтруктураРезультата = Новый Структура("ВыгруженоТоваров,ВыгруженоКартинок,ВыгруженоПредложений,ОписаниеОшибки", 0, 0, 0, "");
	СтруктураТаблицыКаталогов.Вставить("СтруктураРезультата", СтруктураРезультата);
	
	ОсновныеПараметры.Вставить("СтрокаТаблицыКаталогов", СтруктураТаблицыКаталогов);
	
	URI = "urn:1C.ru:commerceml_205";
	ПакетCML = ФабрикаXDTO.Пакеты.Получить(URI);
	
	КоммерческаяИнформацияТип = ПакетCML.Получить("КоммерческаяИнформация");
	КоммерческаяИнформацияXDTO = ФабрикаXDTO.Создать(КоммерческаяИнформацияТип);
	
	КоммерческаяИнформацияXDTO.ВерсияСхемы = "2.05";
	КоммерческаяИнформацияXDTO.ДатаФормирования = ОсновныеПараметры.ДатаФормирования;
	
	ОсновныеПараметры.Вставить("ПустойПакетXDTO", КоммерческаяИнформацияXDTO);
	
	Возврат ОсновныеПараметры;
	
КонецФункции // ПолучитьСтруктуруПараметровОбмена()

Функция ПолучитьСсылкуПоИдентификатору(МенеджерОбъекта, Знач СтрокаGUID)
	
	НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
	
	Попытка
		СсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(НовыйGUID);
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'GetPicture: не удалось получить объект по идентификатору.'"), УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

// Получает файлы, присоединенные к товарам.
//
// Параметры:
//	МассивСсылокНаТовары - массив, содержащий ссылки на товары.
//	РазрешенныеТипыКартинок - массив, содержащий разрешенные типы картинок.
//
// Возвращаемое значение:
//	Выборка файлов.
//
Функция ПолучитьПрисоединенныеФайлы(МассивСсылокНаТовары, РазрешенныеТипыКартинок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Файл,
	|	НоменклатураПрисоединенныеФайлы.Наименование КАК Наименование,
	|	НоменклатураПрисоединенныеФайлы.Описание КАК Описание,
	|	НоменклатураПрисоединенныеФайлы.Том КАК Том,
	|	НоменклатураПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
	|	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение,
	|	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
	|	ПрисоединенныеФайлы.ДвоичныеДанныеФайла КАК ХранимыйФайл
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ПрисоединенныеФайлы
	|			ПО НоменклатураПрисоединенныеФайлы.Ссылка = ПрисоединенныеФайлы.Файл
	|				И (НоменклатураПрисоединенныеФайлы.ТипХраненияФайла = ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе))
	|		ПО Номенклатура.ФайлКартинки = НоменклатураПрисоединенныеФайлы.Ссылка
	|ГДЕ
	|	НоменклатураПрисоединенныеФайлы.Расширение В(&РазрешенныеТипыКартинок)
	|	И Номенклатура.Ссылка В(&МассивСсылокНаТовары)
	|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("РазрешенныеТипыКартинок", РазрешенныеТипыКартинок);
	Запрос.УстановитьПараметр("МассивСсылокНаТовары", МассивСсылокНаТовары);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Формирует пакетный запрос для получения необходимых данных для выгрузки классификатора и каталога.
//
Процедура ДобавитьЗапросыВПакетныйЗапросДляВыгрузкиНоменклатуры(ТекстЗапроса, Параметры)
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС
		+ "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаНоменклатура.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
		|	ВременнаяТаблицаНоменклатура.Родитель КАК Родитель,
		|	ВременнаяТаблицаНоменклатура.Код КАК Код,
		|	ВременнаяТаблицаНоменклатура.Наименование КАК Наименование,
		|	ПОДСТРОКА(ВременнаяТаблицаНоменклатура.Номенклатура.НаименованиеПолное, 1, 100) КАК НаименованиеПолное,
		|	ПОДСТРОКА(ВременнаяТаблицаНоменклатура.Номенклатура.Комментарий, 1, 200) КАК Комментарий,
		|		ВЫБОР
		|			КОГДА ВременнаяТаблицаНоменклатура.Номенклатура.ИспользоватьХарактеристики
		|					И ВременнаяТаблицаНоменклатура.Характеристика.Артикул <> """"
		|				ТОГДА ВременнаяТаблицаНоменклатура.Характеристика.Артикул
		|			ИНАЧЕ ВременнаяТаблицаНоменклатура.Номенклатура.Артикул
		|		КОНЕЦ КАК Артикул,
		|	ВременнаяТаблицаНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ВременнаяТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВременнаяТаблицаНоменклатура.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ВременнаяТаблицаНоменклатура.Номенклатура.Вес КАК Вес,
		|	ВременнаяТаблицаНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаНоменклатура.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
		|	ВременнаяТаблицаНоменклатура.ЕдиницаИзмеренияНаименованиеПолное КАК ЕдиницаИзмеренияНаименованиеПолное,
		|	ВременнаяТаблицаНоменклатура.ЕдиницаИзмеренияМеждународноеСокращение КАК ЕдиницаИзмеренияМеждународноеСокращение,
		|	ВременнаяТаблицаНоменклатура.СтавкаНДС КАК СтавкаНДС,
		|	ВременнаяТаблицаНоменклатура.ФайлКартинки КАК ФайлКартинки,
		|	ЕСТЬNULL(ВременнаяТаблицаШтрихкодыДляКаталога.Штрихкод, """") КАК ШтрихКод
		|ИЗ
		|	ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШтрихкодыДляКаталога КАК ВременнаяТаблицаШтрихкодыДляКаталога
		|		ПО ВременнаяТаблицаНоменклатура.Номенклатура = ВременнаяТаблицаШтрихкодыДляКаталога.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаШтрихкодыДляКаталога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаНоменклатура.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаНоменклатура.Характеристика КАК Характеристика,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство КАК Свойство,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Наименование КАК Наименование,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Значение
		|ИЗ
		|	ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|		ПО ВременнаяТаблицаНоменклатура.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|ИТОГИ ПО
		|	Номенклатура, Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДополнительныеРеквизиты.Номенклатура КАК Номенклатура,
		|	ДополнительныеРеквизиты.Свойство КАК Свойство,
		|	ЗначенияДополнительныхРеквизитов.Значение КАК Значение
		|ПОМЕСТИТЬ ВременнаяТаблицаСвойстваНоменклатуры
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблицаНоменклатура.Номенклатура КАК Номенклатура,
		|		НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство
		|	ИЗ
		|		ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
		|			ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура))) КАК ДополнительныеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ЗначенияДополнительныхРеквизитов
		|		ПО ДополнительныеРеквизиты.Номенклатура = ЗначенияДополнительныхРеквизитов.Ссылка
		|			И ДополнительныеРеквизиты.Свойство = ЗначенияДополнительныхРеквизитов.Свойство
		|	
		|ОБЪЕДИНИТЬ
		|	
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Номенклатура,
		|	ДополнительныеСведения.Свойство,
		|	ЗначенияДополнительныхСведений.Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблицаНоменклатура.Номенклатура КАК Номенклатура,
		|		НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство
		|	ИЗ
		|		ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
		|			ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура))) КАК ДополнительныеСведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДополнительныхСведений
		|		ПО ДополнительныеСведения.Номенклатура = ЗначенияДополнительныхСведений.Объект
		|			И ДополнительныеСведения.Свойство = ЗначенияДополнительныхСведений.Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСвойстваНоменклатуры.Свойство КАК Свойство,
		|	ТаблицаСвойстваНоменклатуры.Свойство.Наименование КАК Наименование,
		|	ТаблицаСвойстваНоменклатуры.Свойство.ТипЗначения КАК ТипЗначения,
		|	ТаблицаСвойстваНоменклатуры.Значение КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ВременнаяТаблицаСвойстваНоменклатуры.Свойство КАК Свойство,
		|		ВременнаяТаблицаСвойстваНоменклатуры.Значение КАК Значение
		|	ИЗ
		|		ВременнаяТаблицаСвойстваНоменклатуры КАК ВременнаяТаблицаСвойстваНоменклатуры) КАК ТаблицаСвойстваНоменклатуры
		|ИТОГИ ПО
		|	Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСвойстваНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаСвойстваНоменклатуры.Свойство КАК Свойство,
		|	ВременнаяТаблицаСвойстваНоменклатуры.Значение КАК Значение
		|ИЗ
		|	ВременнаяТаблицаСвойстваНоменклатуры КАК ВременнаяТаблицаСвойстваНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаСвойстваНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Контрагент,
		|	Организации.Наименование КАК Наименование,
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.ЮридическоеФизическоеЛицо КАК ЮрФизЛицо,
		|	Организации.ИНН КАК ИНН,
		|	Организации.КПП КАК КПП,
		|	Организации.КодПоОКПО КАК КодПоОКПО,
		|	Организации.КонтактнаяИнформация.(
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		Значение КАК Значение
		|	) КАК КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &ОрганизацияВладелецКаталога
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаНоменклатура.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
		|ИТОГИ ПО
		|	Номенклатура ТОЛЬКО ИЕРАРХИЯ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаНоменклатура";
	
КонецПроцедуры

Процедура УстановитьОтборыКомпоновщика(	КомпоновщикНастроек, 
										ДатаИзменения = Неопределено, 
										КодГруппы = Неопределено, 
										КодСклада = Неопределено, 
										КодОрганизации = Неопределено) Экспорт
	
	Отбор = КомпоновщикНастроек.Настройки.Отбор;
	
	Если ТипЗнч(ДатаИзменения) = Тип("Дата") И ЗначениеЗаполнено(ДатаИзменения) Тогда
		
		НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоДатеИзменения";
		НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Номенклатура.ДатаИзменения");
		НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		НовыйЭлемент.ПравоеЗначение = ДатаИзменения;
		НовыйЭлемент.Использование 	= Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодГруппы) Тогда
		
		ГруппаНоменклатуры = Справочники.Номенклатура.НайтиПоКоду(КодГруппы);
		
		Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
			НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоГруппе";
			НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Номенклатура");
			НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВИерархии;
			НовыйЭлемент.ПравоеЗначение = ГруппаНоменклатуры;
			НовыйЭлемент.Использование 	= Истина;
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(КодСклада) Тогда
		
		Склад = Справочники.СтруктурныеЕдиницы.НайтиПоКоду(КодСклада);
		Если Склад = Неопределено Тогда
			Склад = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		КонецЕсли;
		
		НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоСкладу";
		НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СкладДляОстатков");
		НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = Склад;
		НовыйЭлемент.Использование 	= Истина;
		
		НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоОстатку";
		НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Остаток");
		НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Больше;
		НовыйЭлемент.ПравоеЗначение = 0;
		НовыйЭлемент.Использование 	= Истина;
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(КодОрганизации) Тогда
		
		Организация = Справочники.Организации.НайтиПоКоду(КодОрганизации);
		Если Организация = Неопределено Тогда
			Организация = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;
		
		НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоОрганизации";
		НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Организация");
		НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = Организация;
		НовыйЭлемент.Использование 	= Истина;
		
		Если Не ЗначениеЗаполнено(КодСклада) Тогда
			НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоОстатку";
			НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Остаток");
			НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Больше;
			НовыйЭлемент.ПравоеЗначение = 0;
			НовыйЭлемент.Использование 	= Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляВыгрузкиНоменклатуры(Параметры)

	СхемаВыгрузкиТоваров = ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.ПолучитьМакет("СхемаВыгрузкиТоваровВебСервис");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаВыгрузкиТоваров)); 
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаВыгрузкиТоваров.НастройкиПоУмолчанию);

	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИспользоватьХарактеристики");
	ПараметрСКД.Значение = Параметры.ИспользоватьХарактеристики;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОрганизацияВладелецКаталога");
	ПараметрСКД.Значение = Параметры.ОрганизацияВладелецКаталога;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазрешенныеТипыКартинок");
	ПараметрСКД.Значение = Параметры.РазрешенныеТипыКартинок;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазрешенныеТипыНоменклатуры");
	ПараметрСКД.Значение = Параметры.РазрешенныеТипыНоменклатуры;
	ПараметрСКД.Использование = Истина;
	
	// Отбор.
	
	УстановитьОтборыКомпоновщика(КомпоновщикНастроек, Параметры.ДатаИзменения, Параметры.КодГруппы);
	
	// Запрос.
	
	Запрос = ОбменССайтом.ПолучитьЗапросИзМакетаКомпоновки(КомпоновщикНастроек, СхемаВыгрузкиТоваров);
	ДобавитьЗапросыВПакетныйЗапросДляВыгрузкиНоменклатуры(Запрос.Текст, Параметры);
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	Параметры.Вставить("ВыборкаНоменклатуры", МассивРезультатовЗапроса[9].Выбрать());
	
	Параметры.Вставить("ДеревоСвойствХарактеристик", 
		МассивРезультатовЗапроса[11].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Параметры.Вставить("ВыборкаСвойствНоменклатурыДляКлассификатора", 
		МассивРезультатовЗапроса[13].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	РезультатЗапросаСвойствНоменклатуры = МассивРезультатовЗапроса[14];
	Если РезультатЗапросаСвойствНоменклатуры.Пустой() Тогда
		ВыборкаСвойствНоменклатуры = Неопределено;
	Иначе
		ВыборкаСвойствНоменклатуры = РезультатЗапросаСвойствНоменклатуры.Выбрать();
		ВыборкаСвойствНоменклатуры.Следующий();
	КонецЕсли;
		
	Параметры.Вставить("ВыборкаСвойствНоменклатуры", ВыборкаСвойствНоменклатуры);
	
	РезультатЗапросаДанныхОрганизацииВладельцаКаталога = МассивРезультатовЗапроса[16];
	Если РезультатЗапросаДанныхОрганизацииВладельцаКаталога.Пустой() Тогда
		ВыборкаДанныхОрганизацииВладельцаКаталога = Неопределено;
	Иначе
		ВыборкаДанныхОрганизацииВладельцаКаталога = РезультатЗапросаДанныхОрганизацииВладельцаКаталога.Выбрать();
		ВыборкаДанныхОрганизацииВладельцаКаталога.Следующий();
	КонецЕсли;
	
	Параметры.Вставить("ДанныеОрганизацииВладельцаКаталога", ВыборкаДанныхОрганизацииВладельцаКаталога);
	
	Параметры.Вставить("ДеревоГрупп", МассивРезультатовЗапроса[17].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией));
	Параметры.Вставить("ВыборкаФайлов", Неопределено);
		
КонецПроцедуры // ПодготовитьДанныеДляВыгрузкиНоменклатуры(Параметры)

// Формирует пакетный запрос для получения необходимых данных для выгрузки остатков и цен.
//
Процедура ДобавитьЗапросыВПакетныйЗапросДляВыгрузкиОстатковИЦен(ТекстЗапроса, Параметры)
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС
	  	+ "УНИЧТОЖИТЬ ВременнаяТаблицаНоменклатураХарактеристикиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаШтрихкодыДляЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаВидыЦен.ВидЦен КАК ВидЦен,
		|	ВременнаяТаблицаВидыЦен.ВалютаЦены КАК ВалютаЦены,
		|	ВременнаяТаблицаВидыЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
		|ИЗ
		|	ВременнаяТаблицаВидыЦен КАК ВременнаяТаблицаВидыЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаЦены.Характеристика КАК Характеристика,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство КАК Свойство,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Наименование КАК Наименование,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Значение
		|ИЗ
		|	ВременнаяТаблицаЦены КАК ВременнаяТаблицаЦены
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|		ПО ВременнаяТаблицаЦены.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
		|ИТОГИ ПО
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Контрагент,
		|	Организации.Наименование КАК Наименование,
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.ЮридическоеФизическоеЛицо КАК ЮрФизЛицо,
		|	Организации.ИНН КАК ИНН,
		|	Организации.КПП КАК КПП,
		|	Организации.КодПоОКПО КАК КодПоОКПО,
		|	Организации.КонтактнаяИнформация.(
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		Значение КАК Значение
		|	) КАК КонтактнаяИнформация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &ОрганизацияВладелецКаталога";
	
КонецПроцедуры

// Заполняет массив всеми видами цен.
//
Процедура ЗаполнитьМассивВидовЦенПоУмолчанию(МассивВидовЦен)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦен
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен";
	
	МассивВидовЦен = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦен");
	
КонецПроцедуры // ЗаполнитьМассивВидовЦенПоУмолчанию(МассивВидовЦен)

Процедура ПодготовитьДанныеДляВыгрузкиОстатковИЦен(Параметры)
	
	МассивВидовЦен = Параметры.МассивВидовЦен;
	Если МассивВидовЦен.Количество() = 0 Тогда
		ЗаполнитьМассивВидовЦенПоУмолчанию(МассивВидовЦен);
	КонецЕсли;
	
	СхемаВыгрузкиТоваров = ПланыОбмена.ОбменУправлениеНебольшойФирмойСайт.ПолучитьМакет("СхемаВыгрузкиТоваров");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаВыгрузкиТоваров)); 
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаВыгрузкиТоваров.НастройкиПоУмолчанию);
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИспользоватьХарактеристики");
	ПараметрСКД.Значение = Параметры.ИспользоватьХарактеристики;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОрганизацияВладелецКаталога");
	ПараметрСКД.Значение = Параметры.ОрганизацияВладелецКаталога;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВидыЦен");
	ПараметрСКД.Значение = МассивВидовЦен;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("УчетВалютныхОпераций");
	ПараметрСКД.Значение = Параметры.УчетВалютныхОпераций;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазрешенныеТипыНоменклатуры");
	ПараметрСКД.Значение = Параметры.РазрешенныеТипыНоменклатуры;
	ПараметрСКД.Использование = Истина;
	
	 // Отбор.
	 
	УстановитьОтборыКомпоновщика(КомпоновщикНастроек, Параметры.ДатаИзменения, Параметры.КодГруппы, Параметры.КодСклада, Параметры.КодОрганизации);
	
	// Запрос.
	
	Запрос = ОбменССайтом.ПолучитьЗапросИзМакетаКомпоновки(КомпоновщикНастроек, СхемаВыгрузкиТоваров);
	ДобавитьЗапросыВПакетныйЗапросДляВыгрузкиОстатковИЦен(Запрос.Текст, Параметры);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "NULL = &П", "Истина");
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	Параметры.Вставить("ВыборкаЦен", МассивРезультатовЗапроса[17].Выбрать());
	Параметры.Вставить("ВыборкаВидовЦен", МассивРезультатовЗапроса[20].Выбрать());
	
	Параметры.Вставить("ДеревоСвойствХарактеристик", 
		МассивРезультатовЗапроса[21].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	РезультатЗапросаДанныхОрганизацииВладельцаКаталога = МассивРезультатовЗапроса[23];
	Если РезультатЗапросаДанныхОрганизацииВладельцаКаталога.Пустой() Тогда
		ВыборкаДанныхОрганизацииВладельцаКаталога = Неопределено;
	Иначе
		ВыборкаДанныхОрганизацииВладельцаКаталога = РезультатЗапросаДанныхОрганизацииВладельцаКаталога.Выбрать();
		ВыборкаДанныхОрганизацииВладельцаКаталога.Следующий();
	КонецЕсли;
	
	Параметры.Вставить("ДанныеОрганизацииВладельцаКаталога", ВыборкаДанныхОрганизацииВладельцаКаталога);
	
КонецПроцедуры

// Получает заказы покупателей, которые были модифицированы.
//
// Параметры:
//	ДатаИзменения - дата-время, начиная с которого заказ был изменен.
//
// Возвращаемое значение:
//	Массив заказов покупателей.
//
Функция ПолучитьЗаказыДляВыгрузки(ДатаИзменения)
	
	Если ДатаИзменения = '00010101' Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейССайта.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	РегистрСведений.ЗаказыПокупателейССайта КАК ЗаказыПокупателейССайта
	|ГДЕ
	|	ЗаказыПокупателейССайта.ЗаказПокупателя.ДатаИзменения >= &ДатаИзменения";
	
	Запрос.УстановитьПараметр("ДатаИзменения", ДатаИзменения);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
	
КонецФункции // ПолучитьЗаказыДляВыгрузки()

Функция ПолучитьДвоичныеДанныеФайла(ДанныеФайла)
	
	ДвоичныеДанныеФайла = Неопределено;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПлатформаWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	ФайлВХранилище = ДанныеФайла.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе;
	Если ФайлВХранилище Тогда
		
		Если ДанныеФайла.ХранимыйФайл = NULL Тогда
			ДвоичныеДанныеФайла = Неопределено;
		Иначе
			ДвоичныеДанныеФайла = ДанныеФайла.ХранимыйФайл.Получить();
		КонецЕсли;
		
		Если ДвоичныеДанныеФайла = Неопределено Тогда
			
			ОписаниеОшибки = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'GetPicture: не удалось получить данные файла %1 номенклатуры %2.'"),
				ДанныеФайла.Файл,
				ДанныеФайла.Номенклатура),
				УровеньЖурналаРегистрации.Ошибка,,,
				ОписаниеОшибки.Описание);
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		
	Иначе
		
		ИмяФайла = ОбменССайтом.ПодготовитьПутьДляПлатформы(ПлатформаWindows,
			ОбменССайтом.ПолучитьПутьТомаДляПлатформы(ПлатформаWindows, ДанныеФайла.Том) + "\" + ДанныеФайла.ПутьКФайлу);
		
		Попытка
			
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
			
		Исключение
			
			ВызватьИсключение ИнформацияОбОшибке();
			
		КонецПопытки;
	КонецЕсли;
	
	Возврат ДвоичныеДанныеФайла;
	
КонецФункции

Процедура ЗаписатьРезультатВыполненияОперацииВЖурналРегистрации(СобытиеЖурнала, Описание, Ошибка = Ложь)
	
	Если Ошибка Тогда
		УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
	Иначе
		УровеньЖурнала = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(СобытиеЖурнала, УровеньЖурнала,,, Описание);
	
КонецПроцедуры

#КонецОбласти
